<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class SongSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //以下のデータについては、既にテーブルに挿入済み.
        
        $dates = [
            '2016-04-06', '2016-08-10', '2016-11-30', '2017-04-05', '2017-07-19',
            '2017-10-25', '2018-03-07', '2018-08-15', '2019-02-27', '2020-08-21',
            '2020-10-07', '2020-12-09', '2021-04-14', '2021-10-13', '2022-04-06',
            '2022-08-03', '2023-02-15', '2023-06-28', '2023-10-18'
        ];
        
        $songs = [
            [
                'サイレントマジョリティー', '手を繋いで帰ろうか', '山手線', '渋谷川', '乗り遅れたバス', 'キミガイナイ'
            ],
            [
                '世界には愛しかない', '語るなら未来を･･･', '渋谷からPARCOが消えた日', 'また会ってください', '青空が違う', 'ボブディランは返さない'
            ],
            [
                '二人セゾン', '大人は信じてくれない', '制服と太陽', '僕たちの戦争', '夕陽1/3'
            ],
            [
                '不協和音', 'W-KEYAKIZAKAの詩', '微笑みが悲しい', 'チューニング', '割れたスマホ', 'エキセントリック'
            ],
            [
                '月曜日の朝、スカートを切られた', '少女には戻れない', '東京タワーはどこから見える?', '100年待てば', '猫の名前', '太陽は見上げる人を選ばない',
                '危なっかしい計画', '自分の棺', '君をもう探さない', '夏の花は向日葵だけじゃない', '1行だけのエアメール', 'AM1:27', 'ここにない足跡', 'バレエと少年'
            ],
            [
                '風に吹かれても', '結局、じゃあねしか言えない', '避雷針', '波打ち際を走らないか?', '再生する細胞'
            ],
            [
                'ガラスを割れ!', 'もう森へ帰ろうか?', '夜明けの孤独', 'ゼンマイ仕掛けの夢', 'バスルームトラベル'
            ],
            [
                'アンビバレント', 'Student Dance', "I'm out", '302号室', '音楽室に片想い', '日が昇るまで'
            ],
            [
                '黒い羊', 'Nobody', 'ヒールの高さ', 'ごめんね クリスマス', '否定した未来'
            ],
            [
                '誰がその鐘を鳴らすのか?'
            ],
            [
                '10月のプールに飛び込んだ', '砂塵', 'コンセントレーション', '角を曲がる', 'カレイドスコープ', 'Deadline'
            ],
            [
                "Nobody's fault", 'なぜ 恋をして来なかったんだろう?', '半信半疑', 'Plastic regret', '最終の地下鉄に乗って', 'Buddies', 'ブルームーンキス'
            ],
            [
                'BAN', '偶然の答え', 'それが愛なのね', '君と僕と洗濯物', 'Microscope', '思ったよりも寂しくない', '櫻坂の詩'
            ],
            [
                '流れ弾', 'Dead end', 'ソニア', 'ジャマイカビール', 'On my way', '無言の宇宙', '美しきNervous'
            ],
            [
                '五月雨よ', '僕のジレンマ', "I'm in", '断絶', '制服の人魚', '車間距離', '恋が絶滅する日'
            ],
            [
                '摩擦係数', '条件反射で泣けて来る', 'One-way stairs', 'タイムマシーンでYeah!', 'ずっと 春だったらなあ'
            ],
            [
                '桜月', 'Cool', '無念', 'もしかしたら真実', '魂のLiar', '夏の近道', 'その日まで'
            ],
            [
                'Start over!', '静寂の暴力', '風の音', 'コンビナート', 'Anthem time', '一瞬の馬', 'ドローン旋回中'
            ],
            [
                '承認欲求', 'マモリビト', '確信的クロワッサン', '僕たちの La vie en rose', "Don't cut in line!", 'マンホールの蓋の上', '隙間風よ', '君がサヨナラ言えたって･･･'
            ],
        ];
        
        for($i = 0; $i < count($dates); $i++){
            foreach($songs[$i] as $song){
                DB::table('songs')->insert([
                    'name' => $song,
                    'released_on' => $dates[$i],
                ]);
            }
        }
    }
}
